#!/bin/bash

# پایه های شبکه
echo "================ Network Basics ================"
ip addr show
echo "-----------------------------------------------"
route -n
echo "-----------------------------------------------"
cat /etc/resolv.conf
echo "-----------------------------------------------"
cat /etc/hosts
echo "-----------------------------------------------"
echo ""

# ترافیک شبکه
echo "================ Network Traffic ==============="
iftop
echo "-----------------------------------------------"
echo ""

# بررسی پورت ها و اتصالات
echo "================ Network Connections ==========="
netstat -tulpn
echo "-----------------------------------------------"
echo ""

# اطلاعات DNS
echo "================ DNS Info ====================="
nslookup google.com
echo "-----------------------------------------------"
echo ""

# پایه های وضعیت فایروال
echo "================ Firewall Basics ==============="
iptables -L
echo "-----------------------------------------------"
echo ""

# لاگ فایروال
echo "================ Firewall Logs ================="
dmesg | grep -i firewall
echo "-----------------------------------------------"
echo ""

# لاگ های سیستم
echo "================ System Logs ==================="
tail /var/log/messages
echo "-----------------------------------------------"
echo ""
