#!/bin/bash

# نمایش مشخصات پردازنده
echo "---- پردازنده ----"
lscpu

# نمایش مشخصات حافظه RAM
echo ""
echo "---- حافظه RAM ----"
free -h

# نمایش مشخصات دیسک‌ها
echo ""
echo "---- دیسک‌ها ----"
lsblk

# نمایش مشخصات کارت شبکه
echo ""
echo "---- کارت شبکه ----"
lshw -class network

# نمایش مشخصات کارت گرافیکی
echo ""
echo "---- کارت گرافیکی ----"
lshw -class display

# نمایش نام سیستم عامل و نسخه‌ی آن
echo ""
echo "---- سیستم عامل ----"
lsb_release -a

# نمایش نسخه‌ی هسته
echo ""
echo "---- هسته ----"
uname -r

# نمایش نام کاربری و اطلاعات مربوط به آن
echo ""
echo "---- کاربران ----"
w
